src/Catalogs/ШаблоныОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ШаблоныОбследований</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>HTMLШаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Comment>Специализация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствияПараметрам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыОбследований</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядковыйНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыПараметровШаблоновОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыПараметровШаблоновОбследований</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Статический</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Динамический</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ChartsOfCharacteristicTypes/ПараметрыОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ПараметрыОбследований</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.ПричиныОбращения</v8:Type>
				<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияПараметровОбследований</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>10</v8:Digits>
					<v8:FractionDigits>3</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПараметра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПараметровШаблоновОбследований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритВычисления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПривязкаКЗубам</Name>
					<Comment>Данный параметр составной</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодчиненРеквизиту</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыОбследований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/Catalogs/ШаблоныОбследований/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Перем ТекущийПараметр;
&НаКлиенте
Перем IDТекущегоЭлемента;

#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик создания формы на сервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Элементы.Код.Видимость = ОтображниеКода;
	Элементы.Код.ПоложениеЗаголовка = ?(ОтображниеКода, ПоложениеЗаголовкаЭлементаФормы.Авто, ПоложениеЗаголовкаЭлементаФормы.Нет);

	Элементы.Специализация.Видимость = Не Объект.Предопределенный; 
	Элементы.Наименование.МаксимальнаяШирина = ?(Объект.Предопределенный, 38, 51); 
	
	// Заполнить список используемых шрифтов
	ПолучитьИсториюИспользуемыхШрифтов();
	 // Заполнить списко размеров шрифтов
	 Для А = 1 По 14 Цикл		 
		 Элементы.РедактирвоаниеHTMLРазмерШрифта.СписокВыбора.Добавить(А);
	 КонецЦикла;	 
	 // Подготовка основы новго документа 
	 Если Объект.Ссылка.Пустая() Тогда		 
		 		 
		 Объект.HTMLШаблон = "<html>
		 |<head>
		 |<style type=""text/css"">
		 |.no_border_doc { 
		 | width: 21cm;
		 | height: 29cm;
		 |}
		 |
   		 |
		 |.element{
	     | padding: 1px;
	     | color: #AD7E0D;
         |}
		 |.element A{
	     | color: #000000;
	     | text-decoration: none;
         |}
		 |
         |.add_element A{
	     | color: #1834A1;
	     | text-decoration: none;
         |}
		 |.inline {
	     |display: inline;
         |}
         |.add_element A:hover {color: #0B78B9;}
         |.element A:hover{ color: #918F89;}
		 |
         |.add_element {color: #AD7E0D;}
         |BR {margin: 0 0px 0 0;}
		 |
         |P{
	     | margin-bottom: 4px;
	     | margin-top: 0px;
         |}
		 |
         |TABLE{
	     | margin-top: 0px;
	     | margin-bottom: 4px;
         |}
         |DIV{
	     | margin-bottom: 4px;
	     | margin-top: 0px;
         |}
         |H1{
	     | text-align: center;
	     | font-size: 14pt;
         |}
		 |</style>	
		 |</head>
		 |<body><div class=FORMAT >&nbsp</div></body></html>";	 

	 КонецЕсли;
	 
	 ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	 
КонецПроцедуры

&НаСервере 
// Обработчик при загрузке данных формы
//
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	// Заполнить дерево параметров
	ЗаполнитьДеревоПараметровСервер(); 
	
КонецПроцедуры

&НаКлиенте
// Обработчик открытия формы 
//
Процедура ПриОткрытии(Отказ)
	
	Элементы.ПарамтерыШаблонаРежимотображения.Картинка  = ?(НЕ ПарамтерыШаблонаРежимотображения, БиблиотекаКартинок.ВидОтображенияСписокНовый, БиблиотекаКартинок.ВидОтображенияДеревоНовый);
	Элементы.ПарамтерыШаблонаРежимотображения.Заголовок = ?(НЕ ПарамтерыШаблонаРежимотображения,"Список","Дерево");	
	Элементы.ПараметрыШаблонаСостояниеУзлов.Видимость   = НЕ ПарамтерыШаблонаРежимотображения;
    Элементы.ПараметрыШаблонаСостояниеУзлов.Картинка    = ?(ПараметрыШаблонаСостояниеУзлов, БиблиотекаКартинок.СвернутьСписок, БиблиотекаКартинок.РазвернутьСписок);
	Элементы.ПараметрыШаблонаСостояниеУзлов.Заголовок   = ?(ПараметрыШаблонаСостояниеУзлов,"Свернуть все","Развернуть все");
	// Если дерево не было обновлено при создании формы на сервер(первый пуск)
	Если НЕ ПараметрыШаблонаОбновлены Тогда
	     ЗаполнитьДеревоПараметровСервер();
    КонецЕсли;
	Если НЕ ПарамтерыШаблонаРежимотображения И ПараметрыШаблонаСостояниеУзлов  Тогда
		ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы.ПарамтерыШаблона,ПарамтерыШаблона);
    КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Обработчик перед записью     
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		 
	 ТаблицаПараметров = Новый Массив; 
	 Док             = Элементы.HTMLШаблон.Документ.documentElement;
	 СписокЭлементов = Док.getElementsByTagName("A");	 
	 ПорядковыйНомер = 0;
	 Для Каждого Элемент Из СписокЭлементов Цикл		 		 
		 Если НЕ ЗначениеЗаполнено(Элемент.id) Тогда 
			 Продолжить; 
		 КонецЕсли;		
		 Элемент.title = Строка(ПорядковыйНомер);
		 // Вырезаем ИД дополнительного реквизита
		 РеквизитИД = Элемент.id;
		 Если СтрЧислоВхождений(РеквизитИД, ",") > 0 Тогда
		 	РеквизитИД = Лев(РеквизитИД, Найти(РеквизитИД,",") -1 );
		 КонецЕсли;
		 // Поиск сущестующей строки
		 Если ТаблицаПараметров.Найти(РеквизитИД) <> Неопределено Тогда
			 Продолжить;
		 КонецЕсли;
		 
		 ТаблицаПараметров.Добавить(Новый Структура("РеквизитИД, ПорядковыйНомер", РеквизитИД, ПорядковыйНомер));	
		 ПорядковыйНомер = ПорядковыйНомер + 1;
	 КонецЦикла;
	 СписокЭлементов = Док.getElementsByTagName("INPUT");	 
	 Для Каждого Элемент Из СписокЭлементов Цикл		 
		 Если ТаблицаПараметров.Найти(Элемент.id) <> Неопределено 
			 Тогда Продолжить; 
		 КонецЕсли;		
		 
		 ТаблицаПараметров.Добавить(Новый Структура("РеквизитИД, ПорядковыйНомер", Элемент.id, ПорядковыйНомер));
		 Элемент.title   = Строка(ПорядковыйНомер);
		 ПорядковыйНомер = ПорядковыйНомер + 1;
	 КонецЦикла;

	 ЗаписатьТаблицуСоответсвий(ТаблицаПараметров);	 
	 Объект.HTMLШаблон = "<html>" + Элементы.HTMLШаблон.Документ.documentElement.innerHTML + "</html>";
	 
КонецПроцедуры

&НаКлиенте
// Обработчик этой формы о записи нового объекта   
//
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ТипЗнч(НовыйОбъект) = Тип("ПланВидовХарактеристикСсылка.ПараметрыОбследований") Тогда
		ПарамтерыШаблонаОбновить(Неопределено, НовыйОбъект);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Активация строки шаблона
// 
Процедура ПарамтерыШаблонаПриАктивизацииСтроки(Элемент)	 
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда		
		Элементы.ПарамтерыШаблонаПарамтерыШаблонаУдалить.Доступность                 = Не ТекущиеДанные.Предопределенный;
		Элементы.ПарамтерыШаблонаКонтекстноеМенюПарамтерыШаблонаИзменить.Доступность = Не ТекущиеДанные.Предопределенный;
		Элементы.ПарамтерыШаблонаКонтекстноеМенюПарамтерыШаблонаУдалить.Доступность  = Не ТекущиеДанные.Предопределенный;
		ТекущийПараметр = ТекущиеДанные.Ссылка;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработка выбора параметра шаблона
//
Процедура ПарамтерыШаблонаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные      = Элементы.ПарамтерыШаблона.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.ЭтоГруппа = ложь Тогда
		
		ПараметрСсылка     = ТекущиеДанные.Ссылка;
		HTMLДокумент       = Элементы.HTMLШаблон.Документ;
		
		sel = HTMLДокумент.defaultView.getSelection();		
		
		range = sel.getRangeAt(0);
		Если range <> Неопределено Тогда
			range.deleteContents();
			HTMLКонтейнер = range.commonAncestorContainer;
		КонецЕсли;
		
		Если HTMLКонтейнер = Неопределено Тогда
			ПоказатьПредупреждение(,"Укажите позицию добавляемого реквизита в документе");
			Возврат;
		КонецЕсли;  
		
		Если ТекущиеДанные.ТипЗначения.СодержитТип(Тип("Булево")) Тогда
			HTMLКонтейнер.innerHtml = HTMLКонтейнер.innerHtml + Строка(ПараметрСсылка) + " <input type=""checkbox"" id=" 
			+ Строка(ПараметрСсылка.УникальныйИдентификатор()) + " value=""Ложь"">";
		Иначе	
			// Представление элемента 			
			Представление = ?(ТекущиеДанные.ТипПараметра = ПредопределенноеЗначение("Перечисление.ТипыПараметровШаблоновОбследований.Динамический"), 
			"...", "<выбрать...>");	
			
			HTMLКонтейнер.innerHtml = ?(ЗначениеЗаполнено(HTMLКонтейнер.innerHtml), HTMLКонтейнер.innerHtml, "")  		
			+ "<TABLE class=element><TBODY><TR><TD>"+Строка(ПараметрСсылка)+":"+"</TD><TD class=add_element><A id=" + ПараметрСсылка.УникальныйИдентификатор() 
			+ ",Addition title=0 href=about:>" + Представление + "</A></TD></TR></TBODY></TABLE>"; 	
			
		КонецЕсли;
		
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик начало перетаскивания параметра
//
Процедура ПарамтерыШаблонаНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение) 
	
	 ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Перемещение; 
	 
КонецПроцедуры                                                                                                                                     

&НаКлиенте
// Обработчик перетаскивания шаблона
//
Процедура ПарамтерыШаблонаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле) 
	
	СсылкаИсточник = Неопределено;
	Если ПараметрыПеретаскивания.Значение.Количество()>0 Тогда
		СтрокаТ        = ПарамтерыШаблона.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение[0]);	 
		СсылкаИсточник = ?(НЕ СтрокаТ = Неопределено,СтрокаТ.Ссылка,Неопределено);
		Если СтрокаТ <> Неопределено И СтрокаТ.Предопределенный Тогда
			 ПоказатьПредупреждение(,"Перенос предопределенных элементов запрещен!");
			 ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
             Возврат;
		КонецЕсли;
	КонецЕсли;	 	
	СтрокаТ        = ПарамтерыШаблона.НайтиПоИдентификатору(Строка);
	СсылкаПриемник = ?(НЕ СтрокаТ = Неопределено,СтрокаТ.Ссылка,Неопределено);
	Если ЗначениеЗаполнено(СсылкаИсточник) И ЗначениеЗаполнено(СсылкаПриемник) Тогда
		Если СтрокаТ.Предопределенный Тогда
			 ПоказатьПредупреждение(,"Перенос элементов в группу предопределенных параметров запрещен!");
			 ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
             Возврат;
		КонецЕсли;
		ПереместитьПараметр(СсылкаИсточник,СсылкаПриемник);
		ПарамтерыШаблонаОбновить(Неопределено,СсылкаИсточник);
	Иначе
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте   
// Обработчик проверки перетаскивания 
//
Процедура ПарамтерыШаблонаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле) 
	
	Если ТипЗнч(Поле) = Тип("ПолеФормы") И Поле.Родитель = Элементы.ПарамтерыШаблона  Тогда	
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Перемещение;
		СтандартнаяОбработка = Ложь;
	Иначе 	
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Обработчик начало выбора 
//
Процедура РедактирвоаниеHTMLИмяШрифтаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	ВыборШрифта = Новый ДиалогВыбораШрифта;
	ВыборШрифта.Показать(Новый ОписаниеОповещения("РедактирвоаниеHTMLИмяШрифтаПослеВыбора", ЭтотОбъект, Новый Структура("ВыборШрифта", ВыборШрифта))); 
	
КонецПроцедуры

&НаКлиенте
Процедура РедактирвоаниеHTMLИмяШрифтаПослеВыбора(Шрифт, ДополнительныеПараметры) Экспорт
	
	Если Шрифт <> Неопределено Тогда
		Если Элементы.HTMLШаблон.Документ.queryCommandSupported("FontName") Тогда
			Элементы.HTMLШаблон.Документ.execCommand("FontName", Истина, Шрифт.Имя);
			// Добавить имя шрифта в историю выбора
			Разрешить = Истина;
			// Проверка необходимости добавления шрифта в историю
			Для Каждого ЭлСписка ИЗ Элементы.РедактирвоаниеHTMLИмяШрифта.СписокВыбора Цикл
				Если ЭлСписка.Значение = Шрифт.Имя Тогда
					Разрешить = ЛОжь;
					Прервать;
				КонецЕсли;
			КонецЦикла;	
			// Внемение в историю шрифтов разрешено
			Если Разрешить Тогда
				Элементы.РедактирвоаниеHTMLИмяШрифта.СписокВыбора.Добавить(Шрифт.Имя);
				ДобавитьЗначениеВШаблоны(ЭтаФорма.ИмяФормы, "РедактирвоаниеHTMLИмяШрифта",Шрифт.Имя);
			КонецЕсли;	
		КонецЕсли;
		ЭтаФорма.ТекущийЭлемент = Элементы.HTMLШаблон;		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработчик выбора значения списка используемых шрифтов
//
Процедура РедактирвоаниеHTMLИмяШрифтаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) 
	
	Если Элементы.HTMLШаблон.Документ.queryCommandSupported("FontName") Тогда
		Элементы.HTMLШаблон.Документ.execCommand("FontName", Истина, ВыбранноеЗначение);
	КонецЕсли;
	ЭтаФорма.ТекущийЭлемент = Элементы.HTMLШаблон; 
	
КонецПроцедуры

&НаКлиенте
// Обработчик выбора размера шрифта 
//
Процедура РедактирвоаниеHTMLРазмерШрифтаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) 
	
	Если Элементы.HTMLШаблон.Документ.queryCommandSupported("FontSize") Тогда
		Элементы.HTMLШаблон.Документ.execCommand("FontSize", Истина, ВыбранноеЗначение);
	КонецЕсли;
	ЭтаФорма.ТекущийЭлемент = Элементы.HTMLШаблон; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Обновить дерево шаблонов
//
Процедура ПарамтерыШаблонаОбновить(Команда, СсылкаПозиционироваия = Неопределено)
	
	Если СсылкаПозиционироваия = Неопределено Тогда
		ПараметрыШаблонаТекущийПараметр = Неопределено;
		Если НЕ Элементы.ПарамтерыШаблона.ТекущиеДанные = Неопределено Тогда
			ПараметрыШаблонаТекущийПараметр = Элементы.ПарамтерыШаблона.ТекущиеДанные.Ссылка;
		КонецЕсли;
	Иначе
		ПараметрыШаблонаТекущийПараметр = СсылкаПозиционироваия;
	КонецЕсли;
	// Перезаполинть дерево
	ЗаполнитьДеревоПараметровСервер();
	Если НЕ ПарамтерыШаблонаРежимотображения И ПараметрыШаблонаСостояниеУзлов  Тогда
		ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы.ПарамтерыШаблона,ПарамтерыШаблона);
	КонецЕсли;
	// Позиционирование текущего элемента
	Если ЗначениеЗаполнено(ИдентификаторПозиционирования) Тогда
		 Элементы.ПарамтерыШаблона.ТекущаяСтрока = ИдентификаторПозиционирования;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// При изменении режима отображения дерева  
//
Процедура ПарамтерыШаблонаРежимотображения(Команда)	  
	
	ПарамтерыШаблонаРежимотображения = НЕ ПарамтерыШаблонаРежимотображения;	
	// Перезаполинть дерево
	ЗаполнитьДеревоПараметровСервер();			
	Элементы.ПарамтерыШаблонаРежимотображения.Картинка  = ?(НЕ ПарамтерыШаблонаРежимотображения, БиблиотекаКартинок.ВидОтображенияСписокНовый, БиблиотекаКартинок.ВидОтображенияДеревоНовый);
	Элементы.ПарамтерыШаблонаРежимотображения.Заголовок = ?(НЕ ПарамтерыШаблонаРежимотображения,"Список","Дерево");	
	Элементы.ПараметрыШаблонаСостояниеУзлов.Видимость   =  НЕ ПарамтерыШаблонаРежимотображения;
	Если НЕ ПарамтерыШаблонаРежимотображения И ПараметрыШаблонаСостояниеУзлов  Тогда
		ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы.ПарамтерыШаблона,ПарамтерыШаблона);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Состояние узлов дерева 
//
Процедура ПараметрыШаблонаСостояниеУзлов(Команда)
	
	ПараметрыШаблонаСостояниеУзлов              = НЕ ПараметрыШаблонаСостояниеУзлов;
	Элементы.ПарамтерыШаблона.ТекущийЭлемент    = Неопределено;
	Элементы.ПарамтерыШаблона.ТекущаяСтрока     = Неопределено;	
	Если  ПараметрыШаблонаСостояниеУзлов Тогда
		ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы.ПарамтерыШаблона,ПарамтерыШаблона);
	Иначе
		ОбщегоНазначенияКлиентСтоматология.СвернутьДерево(Элементы.ПарамтерыШаблона,ПарамтерыШаблона);
	КонецЕсли;
	Элементы.ПараметрыШаблонаСостояниеУзлов.Картинка  = ?(ПараметрыШаблонаСостояниеУзлов, БиблиотекаКартинок.СвернутьСписок, БиблиотекаКартинок.РазвернутьСписок);
	Элементы.ПараметрыШаблонаСостояниеУзлов.Заголовок = ?(ПараметрыШаблонаСостояниеУзлов,"Свернуть все","Развернуть все");

КонецПроцедуры

&НаКлиенте
// Обработчик кнопки вызова формы создания нового параметра
//
Процедура ПарамтерыШаблонаДобавить(Команда)
	
	ТекущиеДанные = Элементы.ПарамтерыШаблона.ТекущиеДанные;
	Родитель      = Неопределено;
	Если НЕ ТекущиеДанные = Неопределено Тогда 
		Если ТекущиеДанные.ЭтоГруппа Тогда
			Родитель = ТекущиеДанные.Ссылка;
		Иначе
			Родитель = ПолучитьРодителяПараметра(ТекущиеДанные.Ссылка);
		КонецЕсли;
	КонецЕсли;	
	ПараметрыФормы = Новый Структура("Родитель",Родитель);
	ОткрытьФорму("ПланВидовХарактеристик.ПараметрыОбследований.ФормаОбъекта", 
		Новый Структура("ЗначенияЗаполнения",ПараметрыФормы), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Создать группу парамтеров шаблонов   
//
Процедура ПараметрыШаблоновСоздатьПапку(Команда)
	
	ТекущиеДанные = Элементы.ПарамтерыШаблона.ТекущиеДанные;
	Родитель      = Неопределено;
	Если НЕ ТекущиеДанные = Неопределено Тогда 
		Если ТекущиеДанные.ЭтоГруппа Тогда
			Родитель = ТекущиеДанные.Ссылка;
		Иначе
			Родитель = ПолучитьРодителяПараметра(ТекущиеДанные.Ссылка);
		КонецЕсли;
	КонецЕсли;	
	ПараметрыФормы = Новый Структура("Родитель",Родитель);
	ОткрытьФорму("ПланВидовХарактеристик.ПараметрыОбследований.ФормаГруппы",
		Новый Структура("ЭтоГруппа,ЗначенияЗаполнения", Истина, ПараметрыФормы), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Обработчик кнопки вызова формы редактирования элемента парамтера  
//
Процедура ПарамтерыШаблонаИзменить(Команда) 
	
	ТекущиеДанные = Элементы.ПарамтерыШаблона.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено И Не ТекущиеДанные.ЭтоГруппа Тогда 
		ОткрытьФорму("ПланВидовХарактеристик.ПараметрыОбследований.ФормаОбъекта",Новый Структура("Ключ",ТекущиеДанные.Ссылка),ЭтаФорма);
	ИначеЕсли НЕ ТекущиеДанные = Неопределено И ТекущиеДанные.ЭтоГруппа Тогда 
		ОткрытьФорму("ПланВидовХарактеристик.ПараметрыОбследований.ФормаГруппы",Новый Структура("Ключ",ТекущиеДанные.Ссылка),ЭтаФорма);
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
// Обработчик кнопки пометки элемента на удаление  
//
Процедура ПарамтерыШаблонаУдалить(Команда)  
	
	ТекущиеДанные = Элементы.ПарамтерыШаблона.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда 
		ПоказатьВопрос(Новый ОписаниеОповещения("ПарамтерыШаблонаУдалитьЗавершение", ЭтотОбъект, Новый Структура("ДанныеУдаление", ТекущиеДанные.Ссылка)), "Пометить """ +ТекущиеДанные.Ссылка + """ на удаление?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПарамтерыШаблонаУдалитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
		
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПометитьЭлементНаУдаление(ДополнительныеПараметры.ДанныеУдаление);
		ПарамтерыШаблонаОбновить(Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Вставить таблицу  
//
Процедура HTMLВставитьТаблицу(Команда)
	
	HTMLДокумент = Элементы.HTMLШаблон.Документ;
		
	ОткрытьФорму("Справочник.ШаблоныОбследований.Форма.ФормаПарамтерыHTMLТаблицы",,,,,,Новый ОписаниеОповещения("HTMLВставитьТаблицуЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "HTMLВставитьТаблицуЗавершение"
//
Процедура HTMLВставитьТаблицуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	HTMLДокумент       = Элементы.HTMLШаблон.Документ;
	Если НЕ Результат = Неопределено Тогда
		НоваяТаблица             = СоздатьHTMLЭлемент("table");
		НоваяТаблица.width       = "" +Результат.РазмерПоШирине +"%";	
		НоваяТаблица.border      = Результат.ТолщинаЛиний; 
		НоваяТаблица.cellpadding = 0;
		НоваяТаблица.cellspacing = 0;
		НоваяТаблица.align       = "center";
		НоваяТаблица.borderColor = "black";
		Если Результат.ЗаголовокТаблицы <> "" Тогда		
			НоваяТаблица.createCaption();
			НоваяТаблица.caption.innerText = Результат.ЗаголовокТаблицы;		
		КонецЕсли;		
		Для ИндексСтроки = 1 По Результат.КолСтрок Цикл		
			НоваяСтрока = НоваяТаблица.insertRow();			
			Для ИндексСтолб = 1 По Результат.КолКолонок Цикл				
				НоваяЯчейка                = НоваяСтрока.insertCell();
				НоваяЯчейка.innerText      = Символы.НПП;
				НоваяЯчейка.width          = Строка(Окр(100/Результат.КолКолонок)) + "%";
				НоваяЯчейка.style.wordWrap = "break-word";				
			КонецЦикла;			
		КонецЦикла;		
		
		//HTMLОбластьВставки           = Элементы.HTMLШаблон.Документ.selection.createrange();
		//HTMLТекущийЭлемент           = Элементы.HTMLШаблон.Документ.elementFromPoint(HTMLОбластьВставки.offsetLeft, HTMLОбластьВставки.offsetTop);		
		//HTMLТекущийЭлемент.innerHTML = НоваяТаблица.outerHTML;	
		Выделение = HTMLДокумент.getSelection().getRangeAt(0);
		Узел = Выделение.createContextualFragment(НоваяТаблица.outerHTML);
		Выделение.insertNode(Узел);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Вставить линию  
//
Процедура HTMLЛиния(Команда)

	Если Команда.Имя = "HTMLЛинияВертикальная" Тогда
		HTMLОбластьВставки           = Элементы.HTMLШаблон.Документ.selection.createrange();
		HTMLТекущийЭлемент           = Элементы.HTMLШаблон.Документ.elementFromPoint(HTMLОбластьВставки.offsetLeft, HTMLОбластьВставки.offsetTop);	
		HTMLТекущийЭлемент.outerHTML = "<HR>";
	Иначе
		//HTMLОбластьВставки           = Элементы.HTMLШаблон.Документ.selection.createrange();
		//HTMLТекущийЭлемент           = Элементы.HTMLШаблон.Документ.elementFromPoint(HTMLОбластьВставки.offsetLeft, HTMLОбластьВставки.offsetTop);	
		//HTMLТекущийЭлемент.outerHTML = "<HR>"; 	
		Выделение = Элементы.HTMLШаблон.Документ.getSelection().getRangeAt(0);
		Если Выделение <> Неопределено Тогда
			Узел = Выделение.createContextualFragment("<HR>");
			Выделение.insertNode(Узел);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик кнопки устанвоки макета по умолчанию
//
Процедура ОбщийМакетШаблона(Команда)

	Если Элементы.HTMLШаблон.Документ.documentElement.innerHTML <> "" Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбщийМакетШаблонаЗавершение", ЭтотОбъект), 
		"Данные текущего редактирования будут утеряны, продолжить?",РежимДиалогаВопрос.ДаНет);
	Иначе
		ОбщийМакетШаблонаЗавершение(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте 
// Процедура - Общий макет шаблона завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ОбщийМакетШаблонаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда		
		// Вставить макет шаблонп
		Если Объект.Наименование = "Первичный стоматологический осмотр" Тогда
			ПолучитьПервичныйСО();
		ИначеЕсли  Объект.Наименование = "Повторный стоматологический осмотр" Тогда
			ПолучитьПовторныйСО();
		Иначе
			Объект.HTMLШаблон = ПолучитьШаблонМакета();
		КонецЕсли;
		Элементы.HTMLШаблон.Документ.documentElement.innerHTML = Объект.HTMLШаблон;
		HTMLШаблонДокументСформирован(Элементы.HTMLШаблон);		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Применить оформление выделенного содержимого  
//
Процедура ПрименитьОформление(Кнопка) 
	
	Команда = Сред(Кнопка.Имя, 8);
	Если Элементы.HTMLШаблон.Документ.queryCommandSupported(Команда) Тогда
		Элементы.HTMLШаблон.Документ.execCommand(Команда, Ложь);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик выбора цвета   
//
Процедура ВыборЦвета(Команда)
	
	ОткрытьФорму("Обработка.ВыборWebЦвета.Форма",,,,,,
	Новый ОписаниеОповещения("ВыборЦветаЗавершение", ЭтотОбъект, Команда), 
	РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
// Процедура - После выбора Цвета
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВыборЦветаЗавершение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		Кнопка = Сред(ДополнительныеПараметры.Имя, 8);
		Если Элементы.HTMLШаблон.Документ.queryCommandSupported(Кнопка) Тогда
			Элементы.HTMLШаблон.Документ.execCommand(Кнопка, Ложь, "" + ПеревестиИз10(РезультатВыбора.Красный) + ПеревестиИз10(РезультатВыбора.Зеленый) + ПеревестиИз10(РезультатВыбора.Синий));
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте 
// Процедура приведения.
//
Функция ПеревестиИз10(Знач Значение = 0)
	
	Значение = Число(Значение);
	Если Значение <= 0 Тогда
		Возврат "00";
	КонецЕсли;
	
	Значение = Цел(Значение);
	Результат = "";
	
	Пока Значение > 0 Цикл
		Результат = Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ",Значение%16+1,1) + Результат;
		Значение = Цел(Значение/16);
	КонецЦикла;
	
	Если СтрДлина(Результат) = 1 Тогда
		Результат = "0" + Результат;
	КонецЕсли; 
  
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Дебаг(Команда) 
	
	Дебаг = "<html>"+ Элементы.HTMLШаблон.Документ.documentElement.innerHTML+"</html>";  
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Перезагрузить таблицу шаблонов по текущим параметрам 
//
Процедура ПолучитьИсториюИспользуемыхШрифтов()	 
	
	МассивШаблонов = СохранениеВводимыхЗначений.ПрочитатьМассивЗначенийИсторииВвода(ЭтаФорма.ИмяФормы,"РедактирвоаниеHTMLИмяШрифта");
    Список = Элементы.РедактирвоаниеHTMLИмяШрифта.СписокВыбора;
	Список.Очистить();
	Для Каждого ЭлМассива ИЗ МассивШаблонов Цикл
		Список.Добавить(ЭлМассива);
	КонецЦикла;
	
КонецПроцедуры

//////////////////////////////ОБРАБОТЧИКИ ТАБЛИЦЫ ПОДБОРА ПАРАМЕТРОВ/////////////////////////////////

&НаСервере
// Заполнить дерево параметров  
//
Процедура ЗаполнитьДеревоПараметровСервер()
		
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ШаблоныОбследованийПарамтеры.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ШаблоныОбследованийПарамтеры.ЭтоГруппа
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ШаблоныОбследованийПарамтеры.ПометкаУдаления
	|			ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИндексКартинки,
	|	СУММА(ЕСТЬNULL(ЗапросКоличестваЭлементов.Количество, 0)) КАК КоличествоЭлементов,
	|	ШаблоныОбследованийПарамтеры.ЭтоГруппа КАК ЭтоГруппа,
	|	ШаблоныОбследованийПарамтеры.ТипПараметра КАК ТипПараметра,
	|	ШаблоныОбследованийПарамтеры.Предопределенный КАК Предопределенный
	|ИЗ
	|	ПланВидовХарактеристик.ПараметрыОбследований КАК ШаблоныОбследованийПарамтеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШаблоныОбследованийПарамтеры.Ссылка) КАК Количество,
	|			ШаблоныОбследованийПарамтеры.Родитель КАК Родитель
	|		ИЗ
	|			ПланВидовХарактеристик.ПараметрыОбследований КАК ШаблоныОбследованийПарамтеры
	|		ГДЕ
	|			ШаблоныОбследованийПарамтеры.ЭтоГруппа = ЛОЖЬ
	|			И ШаблоныОбследованийПарамтеры.ПометкаУдаления = ЛОЖЬ
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ШаблоныОбследованийПарамтеры.Родитель) КАК ЗапросКоличестваЭлементов
	|		ПО (ШаблоныОбследованийПарамтеры.ЭтоГруппа = ИСТИНА)
	|			И (ЗапросКоличестваЭлементов.Родитель = ШаблоныОбследованийПарамтеры.Ссылка)
	|ГДЕ
	|	ШаблоныОбследованийПарамтеры.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &БезГрупп
	|				ТОГДА ШаблоныОбследованийПарамтеры.ЭтоГруппа = ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ШаблоныОбследованийПарамтеры.Ссылка,
	|	ВЫБОР
	|		КОГДА ШаблоныОбследованийПарамтеры.ЭтоГруппа
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ,
	|	ШаблоныОбследованийПарамтеры.ЭтоГруппа,
	|	ШаблоныОбследованийПарамтеры.ТипПараметра,
	|	ШаблоныОбследованийПарамтеры.Предопределенный,
	|	ВЫБОР
	|		КОГДА ШаблоныОбследованийПарамтеры.ЭтоГруппа
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ШаблоныОбследованийПарамтеры.ПометкаУдаления
	|			ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|АВТОУПОРЯДОЧИВАНИЕ";
	Если НЕ ПарамтерыШаблонаРежимотображения Тогда
		ЗапросДанных.Текст = ЗапросДанных.Текст +" УПОРЯДОЧИТЬ ПО
		|	ЭтоГруппа,
		|	Ссылка
		|ИТОГИ
		|	СУММА(КоличествоЭлементов)
		|ПО
		|	Ссылка ИЕРАРХИЯ"; 
	КонецЕсли;
	ЗапросДанных.УстановитьПараметр("БезГрупп", ПарамтерыШаблонаРежимотображения);
	РезЗапроса = ЗапросДанных.Выполнить();
	ПарамтерыШаблона.ПолучитьЭлементы().Очистить();
	ИдентификаторПозиционирования = Неопределено;
	Если НЕ ПарамтерыШаблонаРежимотображения Тогда
	    РекурсивноеЗаполнениеДереваПарамтеров(РезЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией,"Ссылка"),
			ПарамтерыШаблона.ПолучитьЭлементы(),Неопределено);
	Иначе
		ЗаполнитьПараметрыСписком(РезЗапроса.Выбрать(), ПарамтерыШаблона.ПолучитьЭлементы());
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Функция рекурсивного заполнения дерева
//
Процедура РекурсивноеЗаполнениеДереваПарамтеров(Выборка,Дерево,ПредРодитель) 
	
	Пока Выборка.Следующий() Цикл
		//ИЛИ (Выборка.ЭтоГруппа И Выборка.КоличествоЭлементов = 0)
		Если ПредРодитель =  Выборка.Ссылка  Тогда
			Продолжить;
		КонецЕсли;	
		НовыйЭл = Дерево.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйЭл,Выборка);
		НовыйЭл.ТипЗначения                  = НовыйЭл.Ссылка.ТипЗначения;
		Если ПараметрыШаблонаТекущийПараметр = НовыйЭл.Ссылка Тогда
			ИдентификаторПозиционирования = НовыйЭл.ПолучитьИдентификатор();
		КонецЕсли;	
		Если Выборка.ЭтоГруппа Тогда
			РекурсивноеЗаполнениеДереваПарамтеров(Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией,"Ссылка"),НовыйЭл.ПолучитьЭлементы(),Выборка.Ссылка);
		КонецЕсли;				
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Заполнить дерево парамтеров в виде списка  
//
Процедура ЗаполнитьПараметрыСписком(Выборка,Дерево)  
	
	Пока Выборка.Следующий() Цикл
		НовыйЭл = Дерево.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйЭл,Выборка);	
		НовыйЭл.ТипЗначения = НовыйЭл.Ссылка.ТипЗначения;
		Если ПараметрыШаблонаТекущийПараметр = НовыйЭл.Ссылка Тогда
			ИдентификаторПозиционирования = НовыйЭл.ПолучитьИдентификатор();
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьГлавныйКонтейнер(ДочернийHtmlЭлемент)	 
	
	Если ДочернийHtmlЭлемент.className = "border" Тогда
		Возврат ДочернийHtmlЭлемент;
	ИначеЕсли ДочернийHtmlЭлемент.ParentElement <> Неопределено Тогда
		Возврат ПолучитьГлавныйКонтейнер(ДочернийHtmlЭлемент.ParentElement); 
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

&НаСервере
// Процедура перемещения параметра в другую группу    
//
Процедура ПереместитьПараметр(СсылкаИсточника,СсылкаПриемника)	
	
	ОбъектИсточника = СсылкаИсточника.ПолучитьОбъект();
	Родитель = Неопределено;
	Если СсылкаПриемника.ЭтоГруппа Тогда
		Родитель = СсылкаПриемника;
	Иначе
		Родитель = СсылкаПриемника.Родитель;
	КонецЕсли;		 
	Если НЕ Родитель = ОбъектИсточника.Родитель Тогда
		ОбъектИсточника.Родитель = Родитель;
		ОбъектИсточника.Записать();
	КонецЕсли;
	
КонецПроцедуры

/////////////////////////////////ОБРАБОТЧИКИ ПОЛЯ HTML ДОКУМЕНТА/////////////////////////////////////////

&НаКлиенте   
// Обработчик при формировании документа HTML
//
Процедура HTMLШаблонДокументСформирован(Элемент)  
	
	Документ                      = Элемент.Документ;	
	Документ.body.contentEditable = "true";	
	Если Объект.Ссылка.Пустая() Тогда
		Элементы.HTMLШаблон.Документ.execCommand("JustifyCenter", Ложь);
	КонецЕсли;
	
	#Если не ВебКлиент Тогда
		Системнаяинформация = Новый Системнаяинформация;
		Если Системнаяинформация.ТипПлатформы = ТипПлатформы.Windows_x86 Или Системнаяинформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда 	
			// Перевести позиционирование HTML элемента в верхнее положение
			ТекущийЭлемент = Элементы.HTMLШаблон;
			WSHShell       = Новый COMОбъект("WScript.Shell");
			WSHShell.SendKeys("{PGUP}");
		КонецЕсли;
	#Конецесли	
	
КонецПроцедуры

&НаКлиенте 
// Создать HTML элемент    
//
Функция СоздатьHTMLЭлемент(ТипЭлемента)	 
	
	НовыйЭлемент            = Элементы.HTMLШаблон.Документ.createElement(ТипЭлемента);
	НовыйЭлемент.id         = Строка(Новый УникальныйИдентификатор);
	Возврат НовыйЭлемент;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьШаблонМакета()
	
	Возврат "<!DOCTYPE html>
		|<html><HEAD>
		|<meta http-equiv='X-UA-Compatible' content='IE=10' />
		|<META content=""text/html; charset=utf-8"" http-equiv=Content-Type>
		//|<STYLE type=text/css>.border_doc {
		//|	BORDER-TOP: black 2px solid; HEIGHT: 29cm; BORDER-RIGHT: black 2px solid; BORDER-BOTTOM: black 2px solid; BORDER-LEFT: black 2px solid; WIDTH: 21cm
		//|}
		//|.no_border_doc {
		//|	BORDER-TOP: #cccccc 1px solid; HEIGHT: 29cm; BORDER-RIGHT: #cccccc 1px solid; BORDER-BOTTOM: #cccccc 1px solid; BORDER-LEFT: #cccccc 1px solid; WIDTH: 21cm
		//|}
		//|TABLE {
		//|	BORDER-TOP: black 1px solid; BORDER-RIGHT: black 1px solid; BORDER-COLLAPSE: collapse; BORDER-BOTTOM: black 1px solid; BORDER-LEFT: black 1px solid
		//|}
		//|TD {
		//|	BORDER-TOP: black 1px solid; BORDER-RIGHT: black 1px solid; BORDER-BOTTOM: black 1px solid; BORDER-LEFT: black 1px solid
		//|}
		//|TH {
		//|	BORDER-TOP: black 1px solid; BORDER-RIGHT: black 1px solid; BORDER-BOTTOM: black 1px solid; BORDER-LEFT: black 1px solid
		//|}
		//|</STYLE></HEAD>
		//|<BODY contentEditable=true style=""FONT-FAMILY: Arial"">
		//|<DIV align=center>
		//|<DIV class=no_border_doc>
		//|<P>
		//|<HR>
		//| &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Пациент: Фамилия И.О. <A id="+ ПланыВидовХарактеристик.ПараметрыОбследований.КлиентФИО1.УникальныйИдентификатор()+" href=""about:"">...</A> 
		//|<HR>
		//|&nbsp;Обследование от&nbsp;<A id="+ПланыВидовХарактеристик.ПараметрыОбследований.ДатаДокумента.УникальныйИдентификатор()+" href=""about:"">...</A>&nbsp;г.</P>
		//|<P align=left>&nbsp;&nbsp;&nbsp;&nbsp; Диагноз <A id=" +ПланыВидовХарактеристик.ПараметрыОбследований.Диагноз.УникальныйИдентификатор()+" href=""about:"">[...]</A></P>
		//|<P align=right>&nbsp;</P>
		//|<P align=right>&nbsp;&nbsp;&nbsp;&nbsp; Врач: Фамилия И. О. <A id="+ПланыВидовХарактеристик.ПараметрыОбследований.ВрачФИО1.УникальныйИдентификатор()+" href=""about:"">...</A>&nbsp;&nbsp;&nbsp;&nbsp; </P></DIV></DIV></BODY></html>";
	
		|<STYLE type=text/css>.no_border_doc {
		|	HEIGHT: 29cm; WIDTH: 21cm
		|}
		|.border {
		|	BORDER-TOP: #cccccc 1px solid; HEIGHT: 29cm; BORDER-RIGHT: #cccccc 1px solid; BORDER-BOTTOM: #cccccc 1px solid; TEXT-ALIGN: left; BORDER-LEFT: #cccccc 1px solid; WIDTH: 21cm
		|}
		|.element {
		|	COLOR: #ad7e0d; PADDING-BOTTOM: 1px; PADDING-TOP: 1px; PADDING-LEFT: 1px; PADDING-RIGHT: 1px
		|}
		|.element A {
		|	COLOR: #000000; TEXT-DECORATION: none
		|}
		|.add_element A {
		|	COLOR: #1834a1; TEXT-DECORATION: none
		|}
		|.add_element A:hover {
		|	COLOR: #0b78b9
		|}
		|.element A:hover {
		|	COLOR: #918f89
		|}
		|.add_element {
		|	COLOR: #ad7e0d
		|}
		|BR {
		|	MARGIN: 0px
		|}
		|P {
		|	MARGIN-BOTTOM: 4px; MARGIN-TOP: 0px
		|}
		|TABLE {
		|	MARGIN-BOTTOM: 4px; BORDER-TOP: 0px solid; BORDER-RIGHT: 0px solid; BORDER-BOTTOM: 0px solid; BORDER-LEFT: 0px solid; MARGIN-TOP: 0px
		|}
		|DIV {
		|	MARGIN-BOTTOM: 4px; MARGIN-TOP: 0px
		|}
		|H1 {
		|	FONT-SIZE: 14pt; TEXT-ALIGN: center
		|}
		|</STYLE></HEAD>
		|<BODY contentEditable=true style=""FONT-FAMILY: Arial"">
		|<DIV align=center>
		|<DIV class=border>
		|<HR>
		|<DIV class=add_element>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Пациент: Фамилия И.О. <A id="+ ПланыВидовХарактеристик.ПараметрыОбследований.КлиентФИО1.УникальныйИдентификатор()+" href=""about:"">...</A></DIV> 
		|<HR>
		|<DIV class=add_element style='text-align: center;'>&nbsp;Обследование от&nbsp;<A id="+ПланыВидовХарактеристик.ПараметрыОбследований.ДатаДокумента.УникальныйИдентификатор()+" href=""about:"">...</A>&nbsp;г.</DIV>
		|<TABLE class=element>
		|<TBODY>
		|<TR>
		|<TD>Диагноз:</TD>
		|<TD class=add_element><A id=" +ПланыВидовХарактеристик.ПараметрыОбследований.Диагноз.УникальныйИдентификатор()+",Addition title=4 href=""about:"">&lt;добавить...&gt;</A></TD></TR></TBODY></TABLE>
		|<br>   
		|<DIV class=add_element style='text-align: right;'>Врач: Фамилия И. О. <A id="+ПланыВидовХарактеристик.ПараметрыОбследований.ВрачФИО1.УникальныйИдентификатор()+" href=""about:"">...</A>&nbsp;&nbsp;&nbsp;&nbsp; </DIV></DIV></DIV></BODY></html>";
			
КонецФункции
	
&НаСервере
// Процедура получает шаблон первичного стоматологического обследования
//
Процедура ПолучитьПервичныйСО()
	
	// Заполнение первичного приема	
	ПервичныйСтоматологическийОсмотр               = Справочники.ШаблоныОбследований.ПервичныйСтоматологическийОсмотр.ПолучитьОбъект();
	ПервичныйСтоматологическийОсмотр.Наименование  = "Первичный стоматологический осмотр";
	ПервичныйСтоматологическийОсмотр.Специализация = Справочники.Специализации.Стоматология;
	ПервичныйСтоматологическийОсмотр.HTMLШаблон    =
	 "|<html><HEAD>
	 |<META content=""text/html; charset=utf-8"" http-equiv=Content-Type>
	 |<STYLE type=text/css>.no_border_doc {
	 |	HEIGHT: 29cm; WIDTH: 21cm
	 |}
	 |.border {
	 |	BORDER-TOP: #cccccc 1px solid; HEIGHT: 29cm; BORDER-RIGHT: #cccccc 1px solid; BORDER-BOTTOM: #cccccc 1px solid; TEXT-ALIGN: left; BORDER-LEFT: #cccccc 1px solid; WIDTH: 21cm
	 |}
	 |.element {
	 |	COLOR: #ad7e0d; PADDING-BOTTOM: 1px; PADDING-TOP: 1px; PADDING-LEFT: 1px; PADDING-RIGHT: 1px
	 |}
	 |.element A {
	 |	COLOR: #000000; TEXT-DECORATION: none
	 |}
	 |.add_element A {
	 |	COLOR: #1834a1; TEXT-DECORATION: none
	 |}
	 |.add_element A:hover {
	 |	COLOR: #0b78b9
	 | }
	 |.element A:hover {
	 |	COLOR: #918f89
	 |}
	 |.add_element {
	 |	COLOR: #ad7e0d
	 |}
	 |BR {
	 |	MARGIN: 0px
	 |}
	 |P {
	 |	MARGIN-BOTTOM: 4px; MARGIN-TOP: 0px
	 |}
	 |TABLE {
	 |	MARGIN-BOTTOM: 4px; BORDER-TOP: 0px solid; BORDER-RIGHT: 0px solid; BORDER-BOTTOM: 0px solid; BORDER-LEFT: 0px solid; MARGIN-TOP: 0px
	 |}
	 |DIV {
	 |	MARGIN-BOTTOM: 4px; MARGIN-TOP: 0px
	 |}
	 |H1 {
	 |	FONT-SIZE: 14pt; TEXT-ALIGN: center
	 |}
	 |</STYLE></HEAD>
	 |<BODY contentEditable=true>
	 |<DIV align=center>
	 |<DIV class=border>
	 |<DIV class=FORMAT align=center><FONT size=4><STRONG>Титульный лист</STRONG></FONT></DIV>
	 |<DIV class=FORMAT align=left>&nbsp;</DIV>
	 |<TABLE class=element>
	 |<TBODY>
	 |<TR>
	 |<TD>Диагноз:</TD>
	 |<TD class=add_element><A id=[Диагноз],Addition title=0 href=""about:"">&lt;добавить...&gt;</A></TD></TR></TBODY></TABLE>	 
	 |<TABLE class=element>
	 |<TBODY>
	 |<TR>
	 |<TD>Жалобы:</TD>
	 |<TD class=add_element><A id=[Жалобы],Addition title=1 href=""about:"">&lt;выбрать...&gt;</A></TD></TR></TBODY></TABLE>
	 |<TABLE class=element>
	 |<TBODY>
	 |<TR>
	 |<TD>Перенесенные и сопутствующие заболевания:</TD>
	 |<TD class=add_element><A id=[ПеренесенныеИСопутствующиеЗаболевания],Addition title=2 href=""about:"">&lt;выбрать...&gt;</A></TD></TR></TBODY></TABLE>
	 |<TABLE class=element>
	 |<TBODY>
	 |<TR>
	 |<TD>Развитие настоящего заболевания:</TD> 
	 |<TD class=add_element><A id=[РазвитиеНастоящегоЗаболевания],Addition title=3 href=""about:"">&lt;выбрать...&gt;</A></TD></TR></TBODY></TABLE>
	 |<TABLE class=element>
	 |<TBODY>
	 |<TR>
	 |<TD>Данные объективного исследования:</TD>
	 |<TD class=add_element><A id=[ДанныеОбъективногоИсследования],Addition title=4 href=""about:"">&lt;выбрать...&gt;</A></TD></TR></TBODY></TABLE>
	 |<TABLE class=element>
	 |<TBODY>
	 |<TR>
	 |<TD>Прикус:</TD>
	 |<TD class=add_element><A id=[Прикус],Addition title=5 href=""about:"">&lt;выбрать...&gt;</A></TD></TR></TBODY></TABLE>
	 |<TABLE class=element>
	 |<TBODY>
	 |<TR>  
	 |<TD>Состояние слизистой оболочки полости рта:</TD>
	 |<TD class=add_element><A id=[СостояниеСлизистойОболочкиПолостиРта],Addition title=6 href=""about:"">&lt;выбрать...&gt;</A></TD></TR></TBODY></TABLE>
	 |<TABLE class=element>
	 |<TBODY>
	 |<TR>
	 |<TD> Данные рентгеновских, лабораторных исследований:</TD>
	 |<TD class=add_element><A id=[ДанныеРентгеновскихЛабораторныхИсследований],Addition title=7 href=""about:"">&lt;выбрать...&gt;</A></TD></TR></TBODY></TABLE>
	 |<DIV class=add_element>&nbsp;</DIV>
	 |<DIV class=add_element align=center><FONT color=#272727 size=4><STRONG>Дневник лечения</STRONG></FONT></DIV>
	 |<DIV class=add_element align=left><STRONG><FONT color=#272727 size=4></FONT></STRONG>&nbsp;</DIV>
	 |<TABLE class=element>
	 |<TBODY>
	 |<TR>
	 |<TD>План лечения:</TD>
	 |<TD class=add_element><A id=[ПланЛечения],Addition title=8 href=""about:"">&lt;добавить...&gt;</A></TD></TR></TBODY></TABLE>
	 |<TABLE class=element>
	 |<TBODY>
	 |<TR>
	 |<TD>Лечение:</TD>
	 |<TD class=add_element><A id=[Лечение],Addition title=9 href=""about:"">&lt;добавить...&gt;</A></TD></TR></TBODY></TABLE>
	 |<TABLE class=element>
	 |<TBODY>
	 |<TR> 
	 |<TD>Наставления:</TD> 
	 |<TD class=add_element><A id=[Наставления],Addition title=10 href=""about:"">&lt;выбрать...&gt;</A></TD></TR></TBODY></TABLE> 
	 |<TABLE class=element>
	 |<TBODY>
	 |<TR>
	 |<TD>Эпикриз:</TD>
	 |<TD class=add_element><A id=[Эпикриз],Addition title=11 href=""about:"">&lt;добавить...&gt;</A></TD></TR></TBODY></TABLE></DIV></DIV></BODY></html>";	

	// Установка идентификаторов параметров шаблона
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[Диагноз]", ПланыВидовХарактеристик.ПараметрыОбследований.Диагноз.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[Жалобы]", ПланыВидовХарактеристик.ПараметрыОбследований.Жалобы.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[ПеренесенныеИСопутствующиеЗаболевания]", ПланыВидовХарактеристик.ПараметрыОбследований.ПеренесенныеИСопутствующиеЗаболевания.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[РазвитиеНастоящегоЗаболевания]", ПланыВидовХарактеристик.ПараметрыОбследований.РазвитиеНастоящегоЗаболевания.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[ДанныеОбъективногоИсследования]", ПланыВидовХарактеристик.ПараметрыОбследований.ДанныеОбъективногоИсследования.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[Прикус]", ПланыВидовХарактеристик.ПараметрыОбследований.Прикус.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[СостояниеСлизистойОболочкиПолостиРта]", ПланыВидовХарактеристик.ПараметрыОбследований.СостояниеСлизистойОболочкиПолостиРта.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[ДанныеРентгеновскихЛабораторныхИсследований]", ПланыВидовХарактеристик.ПараметрыОбследований.ДанныеРентгеновскихЛабораторныхИсследований.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[ПланЛечения]", ПланыВидовХарактеристик.ПараметрыОбследований.ПланЛечения.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[Лечение]", ПланыВидовХарактеристик.ПараметрыОбследований.Лечение.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[Наставления]", ПланыВидовХарактеристик.ПараметрыОбследований.Наставления.УникальныйИдентификатор());
	ПервичныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПервичныйСтоматологическийОсмотр.HTMLШаблон,"[Эпикриз]", ПланыВидовХарактеристик.ПараметрыОбследований.Эпикриз.УникальныйИдентификатор());

	// Добавдение строк в таблицу соответсвий парамтеров
	ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Очистить();
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Диагноз;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Жалобы;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.ПеренесенныеИСопутствующиеЗаболевания;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.РазвитиеНастоящегоЗаболевания;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.ДанныеОбъективногоИсследования;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Прикус;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.СостояниеСлизистойОболочкиПолостиРта;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.ДанныеРентгеновскихЛабораторныхИсследований;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.ПланЛечения;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Лечение;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Наставления;
	НоваяСтрока          = ПервичныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Эпикриз;
	
	Объект.HTMLШаблон = ПервичныйСтоматологическийОсмотр.HTMLШаблон;
	// ПервичныйСтоматологическийОсмотр.Записать();

КонецПроцедуры

&НаСервере
// Процедура получает шаблон повторного стоматологического обследования
//
Процедура ПолучитьПовторныйСО()
	
	ПовторныйСтоматологическийОсмотр               = Справочники.ШаблоныОбследований.ПовторныйСтоматологическийОсмотр.ПолучитьОбъект();
	ПовторныйСтоматологическийОсмотр.Наименование  = "Повторный стоматологический осмотр";
	ПовторныйСтоматологическийОсмотр.Специализация = Справочники.Специализации.Стоматология;
	ПовторныйСтоматологическийОсмотр.HTMLШаблон    = "<html><HEAD>
	|<META content=""text/html; charset=utf-8"" http-equiv=Content-Type>
	|<STYLE type=text/css>.no_border_doc {
	|	HEIGHT: 29cm; WIDTH: 21cm
	|}
	|.border {
	|	BORDER-TOP: #cccccc 1px solid; HEIGHT: 29cm; BORDER-RIGHT: #cccccc 1px solid; BORDER-BOTTOM: #cccccc 1px solid; TEXT-ALIGN: left; BORDER-LEFT: #cccccc 1px solid; WIDTH: 21cm
	|}
	|.element {
	|	COLOR: #ad7e0d; PADDING-BOTTOM: 1px; PADDING-TOP: 1px; PADDING-LEFT: 1px; PADDING-RIGHT: 1px
	|}
	|.element A {
	|	COLOR: #000000; TEXT-DECORATION: none
	|}
	|.add_element A {
	|	COLOR: #1834a1; TEXT-DECORATION: none
	|}
	|.add_element A:hover {
	|	COLOR: #0b78b9
	|}
	|.element A:hover {
	|	COLOR: #918f89
	|}
	|.add_element {
	|	COLOR: #ad7e0d
	|}
	|BR {
	|	MARGIN: 0px
	|}
	|P {
	|	MARGIN-BOTTOM: 4px; MARGIN-TOP: 0px
	|}
	|TABLE {
	|	MARGIN-BOTTOM: 4px; BORDER-TOP: 0px solid; BORDER-RIGHT: 0px solid; BORDER-BOTTOM: 0px solid; BORDER-LEFT: 0px solid; MARGIN-TOP: 0px
	|}
	|DIV {
	|	MARGIN-BOTTOM: 4px; MARGIN-TOP: 0px
	|}
	|H1 {
	|	FONT-SIZE: 14pt; TEXT-ALIGN: center
	|}
	|</STYLE></HEAD>
	|<BODY contentEditable=true>
	|<DIV align=center>
	|<DIV class=border>
	|<DIV class=FORMAT align=center><FONT size=4><STRONG>Дневник лечения</STRONG></FONT>&nbsp;</DIV>
	|<TABLE class=element>
	|<TBODY>
	|<TR>
	|<TD>Жалобы:</TD>
	|<TD class=add_element><A id=[Жалобы],Addition title=0 href=""about:"">&lt;выбрать...&gt;</A></TD></TR></TBODY></TABLE>
	|<TABLE class=element>
	|<TBODY>
	|<TR>
	|<TD>Развитие настоящего заболевания:</TD>
	|<TD class=add_element><A id=[РазвитиеНастоящегоЗаболевания],Addition title=1 href=""about:"">&lt;выбрать...&gt;</A></TD></TR></TBODY></TABLE>
	|<TABLE class=element>
	|<TBODY>
	|<TR>
	|<TD>Данные объективного исследования:</TD>
	|<TD class=add_element><A id=[ДанныеОбъективногоИсследования],Addition title=2 href=""about:"">&lt;добавить...&gt;</A></TD></TR></TBODY></TABLE>
	|<TABLE class=element>
	|<TBODY>
	|<TR> 
	|<TD>Данные рентгеновских, лабораторных исследований:</TD>
	|<TD class=add_element><A id=[ДанныеРентгеновскихЛабораторныхИсследований],Addition title=3 href=""about:"">&lt;выбрать...&gt;</A></TD></TR></TBODY></TABLE>
	|<TABLE class=element>
	|<TBODY>
	|<TR>
	|<TD>Диагноз:</TD>
	|<TD class=add_element><A id=[Диагноз],Addition title=4 href=""about:"">&lt;добавить...&gt;</A></TD></TR></TBODY></TABLE>
	|<TABLE class=element>
	|<TBODY>
	|<TR>
	|<TD>План лечения:</TD>
	|<TD class=add_element><A id=[ПланЛечения],Addition title=5 href=""about:"">&lt;добавить...&gt;</A></TD></TR></TBODY></TABLE>
	|<TABLE class=element>
	|<TBODY>
	|<TR>
	|<TD>Лечение:</TD>
	|<TD class=add_element><A id=[Лечение],Addition title=6 href=""about:"">&lt;добавить...&gt;</A></TD></TR></TBODY></TABLE>
	|<TABLE class=element> 
	|<TBODY>
	|<TR>
	|<TD>Наставления:</TD>
	|<TD class=add_element><A id=[Наставления],Addition title=6 href=""about:"">&lt;выбрать...&gt;</A></TD></TR></TBODY></TABLE>
	|<TABLE class=element>
	|<TBODY>
	|<TR>
	|<TD>Эпикриз:</TD>
	|<TD class=add_element><A id=[Эпикриз],Addition title=7 href=""about:"">&lt;добавить...&gt;</A></TD></TR></TBODY></TABLE></DIV></DIV></BODY></html>";	

	// Установка идентификаторов параметров шаблона
	ПовторныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПовторныйСтоматологическийОсмотр.HTMLШаблон,"[Жалобы]", ПланыВидовХарактеристик.ПараметрыОбследований.Жалобы.УникальныйИдентификатор());
	ПовторныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПовторныйСтоматологическийОсмотр.HTMLШаблон,"[РазвитиеНастоящегоЗаболевания]", ПланыВидовХарактеристик.ПараметрыОбследований.РазвитиеНастоящегоЗаболевания.УникальныйИдентификатор());	
	ПовторныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПовторныйСтоматологическийОсмотр.HTMLШаблон,"[ДанныеОбъективногоИсследования]", ПланыВидовХарактеристик.ПараметрыОбследований.ДанныеОбъективногоИсследования.УникальныйИдентификатор());
	ПовторныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПовторныйСтоматологическийОсмотр.HTMLШаблон,"[ДанныеРентгеновскихЛабораторныхИсследований]", ПланыВидовХарактеристик.ПараметрыОбследований.ДанныеРентгеновскихЛабораторныхИсследований.УникальныйИдентификатор());
	ПовторныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПовторныйСтоматологическийОсмотр.HTMLШаблон,"[Диагноз]", ПланыВидовХарактеристик.ПараметрыОбследований.Диагноз.УникальныйИдентификатор());
	ПовторныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПовторныйСтоматологическийОсмотр.HTMLШаблон,"[ПланЛечения]", ПланыВидовХарактеристик.ПараметрыОбследований.ПланЛечения.УникальныйИдентификатор());
	ПовторныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПовторныйСтоматологическийОсмотр.HTMLШаблон,"[Лечение]", ПланыВидовХарактеристик.ПараметрыОбследований.Лечение.УникальныйИдентификатор());
	ПовторныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПовторныйСтоматологическийОсмотр.HTMLШаблон,"[Наставления]", ПланыВидовХарактеристик.ПараметрыОбследований.Наставления.УникальныйИдентификатор());
	ПовторныйСтоматологическийОсмотр.HTMLШаблон = СтрЗаменить(ПовторныйСтоматологическийОсмотр.HTMLШаблон,"[Эпикриз]", ПланыВидовХарактеристик.ПараметрыОбследований.Эпикриз.УникальныйИдентификатор());

	// Добавдение строк в таблицу соответсвий парамтеров
	ПовторныйСтоматологическийОсмотр.СоответствияПараметрам.Очистить();
	НоваяСтрока          = ПовторныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Жалобы;
	НоваяСтрока          = ПовторныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.РазвитиеНастоящегоЗаболевания;	
	НоваяСтрока          = ПовторныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.ДанныеОбъективногоИсследования;
	НоваяСтрока          = ПовторныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.ДанныеРентгеновскихЛабораторныхИсследований;
	НоваяСтрока          = ПовторныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Диагноз;
	НоваяСтрока          = ПовторныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.ПланЛечения;
	НоваяСтрока          = ПовторныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Лечение;
	НоваяСтрока          = ПовторныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Наставления;
	НоваяСтрока          = ПовторныйСтоматологическийОсмотр.СоответствияПараметрам.Добавить();
	НоваяСтрока.Параметр = ПланыВидовХарактеристик.ПараметрыОбследований.Эпикриз;
	
	Объект.HTMLШаблон = ПовторныйСтоматологическийОсмотр.HTMLШаблон;
	//ПовторныйСтоматологическийОсмотр.Записать();

КонецПроцедуры
////////////////////////////////////ДОПОЛНИТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ////////////////////////////////////////

&НаСервереБезКонтекста
// Процедура добавления значения в шаблоны  
//
Процедура ДобавитьЗначениеВШаблоны(ИмяФормы, ИмяЭлемента, ТекстШаблона)  
	
	 СохранениеВводимыхЗначений.ЗаписатьЗначениеВИсториюВвода(ИмяФормы,ИмяЭлемента,,ТекстШаблона);  
	 
КонецПроцедуры	

&НаСервере
// Преобразовать строки в ссылки  
//
Процедура ЗаписатьТаблицуСоответсвий(ТаблицаПараметров)   
	
	Объект.СоответствияПараметрам.Очистить();
	Для Каждого ЭлементМ Из ТаблицаПараметров Цикл
		НоваяСтрока                 = Объект.СоответствияПараметрам.Добавить();
		УИД = Новый УникальныйИдентификатор(ЭлементМ.РеквизитИД);
		НоваяСтрока.Параметр        = ПланыВидовХарактеристик.ПараметрыОбследований.ПолучитьСсылку(УИД);	
		НоваяСтрока.ПорядковыйНомер = ЭлементМ.ПорядковыйНомер;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервереБезконтекста
// Получить ссылку на родителя параметра  
//
Функция ПолучитьРодителяПараметра(ПараметрСсылка)   
	
	Возврат ПараметрСсылка.Родитель; 
	
КонецФункции

&НаСервереБезконтекста
// Процедура почает элемент как удаленный  
//
Процедура ПометитьЭлементНаУдаление(ЭлементСсылка) 
	
	ЭлементСсылка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);   
	
КонецПроцедуры

&НаКлиенте
// При изменении выбора специализации 
//
Процедура СпециализацияПриИзменении(Элемент)  
	
	ПарамтерыШаблонаОбновить(Неопределено); 
	
КонецПроцедуры

#КонецОбласти
